#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

module.snowflake_resources.snowflake_database.tf_demo_database: Refreshing state... [id=TERRAFORM_DEMO_PROD]
module.snowflake_resources.snowflake_storage_integration.integration: Refreshing state... [id=AR_AZURE_INT]
module.snowflake_resources.snowflake_notification_integration.integration: Refreshing state... [id=MY_NOTIFICATION_INTEGRATION]
module.snowflake_resources.snowflake_database_grant.database_ro_grant: Refreshing state... [id=TERRAFORM_DEMO_PROD|USAGE|false|TF_DEMO_READER|]
module.snowflake_resources.snowflake_schema.tf_demo_schema: Refreshing state... [id=TERRAFORM_DEMO_PROD|TF_DEMO]
module.snowflake_resources.snowflake_schema_grant.schema_ro_grant: Refreshing state... [id=TERRAFORM_DEMO_PROD|TF_DEMO|USAGE|false|false|false|TF_DEMO_READER|]
module.snowflake_resources.snowflake_table_grant.table_ro_grant: Refreshing state... [id=TERRAFORM_DEMO_PROD|TF_DEMO||SELECT|false|true|false|TF_DEMO_READER|]
module.snowflake_resources.snowflake_view_grant.view_ro_grant: Refreshing state... [id=TERRAFORM_DEMO_PROD|TF_DEMO||SELECT|false|true|false|TF_DEMO_READER|]
module.snowflake_resources.snowflake_table.demo_table: Refreshing state... [id=TERRAFORM_DEMO_PROD|TF_DEMO|DEMO_TABLE]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.snowflake_resources.snowflake_file_format.example_file_format will be created
  + resource "snowflake_file_format" "example_file_format" {
      + binary_format                = "HEX"
      + compression                  = "AUTO"
      + database                     = "TERRAFORM_DEMO_PROD"
      + date_format                  = "AUTO"
      + empty_field_as_null          = true
      + encoding                     = "UTF8"
      + escape                       = "NONE"
      + escape_unenclosed_field      = "\\"
      + field_delimiter              = ","
      + field_optionally_enclosed_by = "\""
      + format_type                  = "CSV"
      + id                           = (known after apply)
      + name                         = "AR_DEMO_CSV_FORMAT"
      + null_if                      = [
          + "NULL",
          + "null",
        ]
      + record_delimiter             = <<-EOT
            
        EOT
      + schema                       = "TF_DEMO"
      + skip_header                  = 1
      + time_format                  = "AUTO"
      + timestamp_format             = "AUTO"
    }

  # module.snowflake_resources.snowflake_file_format_grant.grant will be created
  + resource "snowflake_file_format_grant" "grant" {
      + database_name          = "TERRAFORM_DEMO_PROD"
      + enable_multiple_grants = false
      + file_format_name       = "AR_DEMO_CSV_FORMAT"
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "USAGE"
      + roles                  = [
          + "ACCOUNTADMIN",
          + "TF_DEMO_READER",
        ]
      + schema_name            = "TF_DEMO"
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_notification_integration.integration will be updated in-place
  ~ resource "snowflake_notification_integration" "integration" {
      + azure_tenant_id                 = "ebfb8680-a5f0-429d-979e-189595b7560f"
      + comment                         = "A notification integration."
        id                              = "MY_NOTIFICATION_INTEGRATION"
        name                            = "MY_NOTIFICATION_INTEGRATION"
        # (4 unchanged attributes hidden)
    }

  # module.snowflake_resources.snowflake_pipe.pipe will be created
  + resource "snowflake_pipe" "pipe" {
      + auto_ingest          = true
      + comment              = "A pipe."
      + copy_statement       = "copy into TERRAFORM_DEMO_PROD.TF_DEMO.DEMO_TABLE from @TERRAFORM_DEMO_PROD.TF_DEMO.MYSTAGE file_format = TERRAFORM_DEMO_PROD.TF_DEMO.AR_DEMO_CSV_FORMAT"
      + database             = "TERRAFORM_DEMO_PROD"
      + id                   = (known after apply)
      + integration          = "MY_NOTIFICATION_INTEGRATION"
      + name                 = "STAGE_PIPE"
      + notification_channel = (known after apply)
      + owner                = (known after apply)
      + schema               = "TF_DEMO"
    }

  # module.snowflake_resources.snowflake_stage.example_stage will be created
  + resource "snowflake_stage" "example_stage" {
      + aws_external_id     = (known after apply)
      + database            = "TERRAFORM_DEMO_PROD"
      + id                  = (known after apply)
      + name                = "MYSTAGE"
      + schema              = "TF_DEMO"
      + snowflake_iam_user  = (known after apply)
      + storage_integration = "AR_AZURE_INT"
      + url                 = "azure://cicddatalake.blob.core.windows.net/iwx-cicddatalake/sample_data/"
    }

  # module.snowflake_resources.snowflake_stage_grant.grant_example_stage will be created
  + resource "snowflake_stage_grant" "grant_example_stage" {
      + database_name          = "TERRAFORM_DEMO_PROD"
      + enable_multiple_grants = false
      + id                     = (known after apply)
      + on_all                 = false
      + on_future              = false
      + privilege              = "USAGE"
      + roles                  = [
          + "ACCOUNTADMIN",
          + "TF_DEMO_READER",
        ]
      + schema_name            = "TF_DEMO"
      + stage_name             = "MYSTAGE"
      + with_grant_option      = false
    }

  # module.snowflake_resources.snowflake_storage_integration.integration will be updated in-place
  ~ resource "snowflake_storage_integration" "integration" {
      + azure_tenant_id             = "ebfb8680-a5f0-429d-979e-189595b7560f"
        id                          = "AR_AZURE_INT"
        name                        = "AR_AZURE_INT"
        # (8 unchanged attributes hidden)
    }

Plan: 5 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @abhr1994, Action: `pull_request`*